{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"conv2d_input:0": {"name": "conv2d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"dense_1/Sigmoid:0": {"name": "dense_1/Sigmoid:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "conv2d_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "18496"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d/Relu", "op": "_FusedConv2D", "input": ["conv2d_input", "conv2d/kernel", "conv2d/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "max_pooling2d/MaxPool", "op": "MaxPool", "input": ["conv2d/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv2d_1/Relu", "op": "_FusedConv2D", "input": ["max_pooling2d/MaxPool", "conv2d_1/kernel", "conv2d_1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["conv2d_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv2d_2/Relu", "op": "_FusedConv2D", "input": ["max_pooling2d_1/MaxPool", "conv2d_2/kernel", "conv2d_2/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["conv2d_2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "flatten/Reshape", "op": "Reshape", "input": ["max_pooling2d_2/MaxPool", "flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense/Relu", "op": "_FusedMatMul", "input": ["flatten/Reshape", "dense/kernel", "dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["dense/Relu", "dense_1/kernel", "dense_1/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "dense_1/Sigmoid", "op": "Sigmoid", "input": ["dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of10.bin", "group1-shard2of10.bin", "group1-shard3of10.bin", "group1-shard4of10.bin", "group1-shard5of10.bin", "group1-shard6of10.bin", "group1-shard7of10.bin", "group1-shard8of10.bin", "group1-shard9of10.bin", "group1-shard10of10.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [16], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "dense/kernel", "shape": [18496, 512], "dtype": "float32"}]}]}